In [ ]:
#NAMA ICHA NURA NUGRAHA 
#KELAS 19-INFORMATIKA BDL 5
#NIM 19.11.2646

Latihan 1.1

In [1]:
#Nomor 1
import pymongo # import library pymongo sebagai driver penghubung antara mongoDB dengan python

client = pymongo.MongoClient('mongodb://localhost:27017/') #koneksi mongoDB local dengan koneksi server
db_local_public = client['p11_bdl5']  #inisialisasi nama database mongodb client

checkinfo = db_local_public.checklocalpublic

records={ # input data format json disimpan kedalam varible records 
      'nama ': 'icha',
      'nim ': '19112646',
      'kelas' :' s1-informatika bdl5'
}
checkinfo.insert_one(records) #input varble record kedalam variable collection nama checkinfo

In [6]:
#Langkah pertama open mongodb shell dan create user 
#open command prompt
#1.mongo
#2.mongo --username mongo --password mongo
# db.createUser(
#     {
#       user : "ichak_bdl5",
#       pwd: "kodenuklir",
#       roles:[
#         {role:"read",db:"test"}
#       ]
#     }
#   )

#setelah selesai create user keluar dari mongodb shell ctrl + d
#login dengan perintah
#mongo --username ichak_bdl5 --password kodenuklir --authenticationDatabase test
#untuk sebelum check user yang sudah kita buat berhasil atau belum dibuat ketikan perintah 'db.getUsers()'
#input authentications untuk new connection 
import pymongo
client = pymongo.MongoClient('mongodb://ichak_bdl5:kodenuklir@localhost:27017/?authMechanism=DEFAULT&directConnection=true&authSource=test') #url yang akan kita gunakan untuk menghubukan mongodb compass dengan python
db= client['soal2'] #nama database
print(db.list_collection_names()) #disini saya juga sudah membuat 1 collections bernama soal2

['soal2']

In [4]:
import pymongo
client= pymongo.MongoClient('mongodb+srv://Raha343214:kodenuklir@bdl-5.obp0j.mongodb.net/?retryWrites=true&w=majority') #disini koneksi terhubung dengan mongoDB Cluster 
#connect > connect your application > pilih driver python dan pilih versi 
db = client['BDL-5'] #dengan nama database BDL-5 
print(db.list_collection_names()) # fungsi print mencetak varibale collection DB yang ada pada Client database Nama BDL-5

[]

KESIMPULAN

Hal yang dapat saya simpulkan dari 3 proses connections Database MongoDB adalah setiap connection memiliki keamanan masing masing 
berdasarkan authentications dalam connections serverlocal antar computer internal tidak memerlukan keamanan dan hanya perlu terkoneksi server local ,
hal yang berbeda pada latihan 1.1 terlihat disaat membuat user untuk melakukan authentikasi sebagai langkah keamanan database mongodb yang terhubung 
pada serverlocal . keamanan ditingkat kembali pembuatan database menggunakan cloud atau cluster mongodb atlas dengan melakukan connection berdasarkan 
program yang akan dibuat dan memiliki versi ditambah dengan authentikasi sebagai langkah tingka keamanan

LATIHAN 2.1

In [1]:
#disini saya menggunakan dataset passengers pada nomor 3 untuk mengetahui seperti nilai yang memiliki sifat incomplete
#nilai yang bersifat noisy , duplicate , dan incosistent

import pymongo
import pandas as pd
import numpy as np
client = pymongo.MongoClient('mongodb://localhost:27017/')
db = client['titanic']
print(db.list_collection_names())

['passengers']

In [2]:
passengers = db.passengers

res = passengers.find()
df_passengers = pd.DataFrame(list(res))

In [3]:

df_passengers.shape

(891, 13)

In [4]:
df_passengers
#disini kita bisa melihat pada colom cabin terdapat data kosong yang artinya data tersebut merupakan
#data incomplete atau data kosong yang artinya data tersebut merupakan nilai nilai atribut kurang 
#atau atribut penting tapi tidak disertakan yang artinya data tersebut menjadi data agregasi

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,S,C123
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
887,60d04ebfdb8077b4ebc989d6,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,S,B42
888,60d04ebfdb8077b4ebc989d7,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,S,NaN
889,60d04ebfdb8077b4ebc989d8,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C,C148
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

In [26]:
#mengidentifikasi nilai tak wajar sebagai missing value

df_passengers['PassengerId']=df_passengers['PassengerId'].replace(0,np.nan)
df_passengers['Survived']=df_passengers['Survived'].replace(0,np.nan)
df_passengers['Pclass']=df_passengers['Pclass'].replace(0,np.nan)
df_passengers['Age']=df_passengers['Age'].replace(0,np.nan)
df_passengers['SibSp']=df_passengers['Parch'].replace(0,np.nan)
df_passengers['Ticket']=df_passengers['Ticket'].replace(0,np.nan)
df_passengers['Fare']=df_passengers['Fare'].replace(0,np.nan)
df_passengers['Cabin']=df_passengers['Cabin'].replace(0,np.nan)

In [5]:
# #check value data kosong
# total=df_passengers.isnull().sum().sort_values(ascending=False)
# print(total)

df_passengers.isnull().sum()

_id              0
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
Cabin          687
dtype: int64

In [7]:
df_passengers.head()

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,S,C123
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN

In [29]:
#disini kita dapat untuk melakukan penghapusan data kosong dengan method dropna 
df_passengers_clean = df_passengers.dropna()

In [49]:
#lalu kita dapat mengecheck kembali bagaimana dataset yang kita miliki masih terdapat data kosong atau tidak
df_passengers_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   _id          183 non-null    object
 1   PassengerId  183 non-null    string
 2   Survived     183 non-null    int32
 3   Pclass       183 non-null    int32
 4   Name         183 non-null    string
 5   Sex          183 non-null    string
 6   Age          183 non-null    int32
 7   SibSp        183 non-null    int32
 8   Parch        183 non-null    int32
 9   Ticket       183 non-null    string
 10  Fare         183 non-null    float64
 11  Embarked     183 non-null    string
 12  Cabin        183 non-null    string
dtypes: float64(1), int32(5), object(1), string(6)
memory usage: 16.4+ KB

In [ ]:
# Noisy: memuat error atau memuat outliers (data 
# yang secara nyata berbeda dengan data-data yang 
# lain)
# Misal, Age=“32.5"

In [ ]:
# Tak-konsisten: memuat perbedaan dalam kode atau
# nama
# Misal, Age=“42” Birthday=“03/07/1997”
# Misal, rating sebelumnya “1,2,3”, sekarang
# rating “A, B, C”
# Misal, perbedaan antara duplikasi record

In [51]:
print(df_passengers_clean[df_passengers_clean["Age"] > 32.5].head())

                         _id PassengerId  Survived  Pclass  \
1   60d04ebfdb8077b4ebc98660           2         1       1
3   60d04ebfdb8077b4ebc98662           4         1       1
6   60d04ebfdb8077b4ebc98665           7         0       1
11  60d04ebfdb8077b4ebc9866a          12         1       1
21  60d04ebfdb8077b4ebc98674          22         1       2

                                                 Name     Sex  Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35      1
6                             McCarthy, Mr. Timothy J    male   54      0
11                           Bonnell, Miss. Elizabeth  female   58      0
21                              Beesley, Mr. Lawrence    male   34      0

    Parch    Ticket     Fare Embarked Cabin
1       0  PC 17599  71.2833        C   C85
3       0    113803  53.1000        S  C123
6       0     17463  51.8625        S   E46
11      0    113783  26.5500        S  C103
21      0    248698  13.0000        S   D56

In [48]:
df_passengers_clean['PassengerId']=df_passengers_clean['PassengerId'].astype('string')
df_passengers_clean['Survived']=df_passengers_clean['Survived'].astype('int')
df_passengers_clean['Pclass']=df_passengers_clean['Pclass'].astype('int')
df_passengers_clean['Name']=df_passengers_clean['Name'].astype('string')
df_passengers_clean['Sex']=df_passengers_clean['Sex'].astype('string')
df_passengers_clean['Age']=df_passengers_clean['Age'].astype('int')

df_passengers_clean['SibSp']=df_passengers_clean['SibSp'].astype('int')
df_passengers_clean['Parch']=df_passengers_clean['Parch'].astype('int')
df_passengers_clean['Ticket']=df_passengers_clean['Ticket'].astype('string')
df_passengers_clean['Fare']=df_passengers_clean['Fare'].astype('float')
df_passengers_clean['Embarked']=df_passengers_clean['Embarked'].astype('string')
df_passengers_clean['Cabin']=df_passengers_clean['Cabin'].astype('string')

In [30]:
#kita dapat menggunakan method isnull dan sum sebagai langkah pengecheckan data yang kosong 
df_passengers_clean.isnull().sum()

_id            0
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Cabin          0
dtype: int64

In [52]:
df_passengers_clean.dtypes

_id             object
PassengerId     string
Survived         int32
Pclass           int32
Name            string
Sex             string
Age              int32
SibSp            int32
Parch            int32
Ticket          string
Fare           float64
Embarked        string
Cabin           string
dtype: object

In [58]:
#check noisy atau check outlier menggunakan boxplot
# import seaborn as sns
# df_passengers=['Survived','Pclass','Age','SibSp','Parch']
# ax = sns.boxplot(df_passengers['Age'])

Dari beberapa nilai yang saya lihat disini saya menggunakan library Pandas dalam melakukan pembacaan agar mudah untuk mengetahui nilai yang bersifat tidak lengkap , noisy atau tidak sama , tidak konsisten dan terdapat beberapa data yang memungkinkan terduplikat secara system ketika melakukan input dataset . dalam melakukan langkah data mising dapat melakukan menggunakan method dropna sebagai langkah penghapusan data kosong

LATIHAN 3

In [1]:
import pymongo
import pandas as pd
import numpy as np
client = pymongo.MongoClient('mongodb://localhost:27017/')
db = client['titanic']
print(db.list_collection_names())

['passengers']

In [2]:
passengers = db.passengers

res = passengers.find()
df_passengers = pd.DataFrame(list(res))

In [38]:
df_passengers['PassengerId']=df_passengers['PassengerId'].astype('string')
df_passengers['Survived']=df_passengers['Survived'].astype('string')
df_passengers['Pclass']=df_passengers['Pclass'].astype('int')
df_passengers['Name']=df_passengers['Name'].astype('string')
df_passengers['Sex']=df_passengers['Sex'].astype('string')
df_passengers['Age']=df_passengers['Age'].astype('int')
df_passengers['SibSp']=df_passengers['SibSp'].astype('int')
df_passengers['Parch']=df_passengers['Parch'].astype('int')
df_passengers['Ticket']=df_passengers['Ticket'].astype('string')
df_passengers['Fare']=df_passengers['Fare'].astype('float')
df_passengers['Embarked']=df_passengers['Embarked'].astype('string')
df_passengers['Cabin']=df_passengers['Cabin'].astype('string')

In [39]:
df_passengers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   _id          183 non-null    object
 1   PassengerId  183 non-null    string
 2   Survived     183 non-null    string
 3   Pclass       183 non-null    int32
 4   Name         183 non-null    string
 5   Sex          183 non-null    string
 6   Age          183 non-null    int32
 7   SibSp        183 non-null    int32
 8   Parch        183 non-null    int32
 9   Ticket       183 non-null    string
 10  Fare         183 non-null    float64
 11  Embarked     183 non-null    string
 12  Cabin        183 non-null    string
dtypes: float64(1), int32(4), object(1), string(7)
memory usage: 17.2+ KB

In [11]:
data = [df_passengers]
titles = ["Pessangers"]

info_df = pd.DataFrame({})

info_df['Nama Collections']= titles

#Menampilkan nama yang ada pada kolom data
info_df['Nama Kolom'] = [', '.join([col for col, null in df.isnull().sum().items()]) for df in data]

#Melakukan penjumlahan kolom pada data
info_df['Jumlah Kolom']= [df.shape[1] for df in data]

#Melakukan penjumlahan nilai yang kosong (Null)
info_df['Total Nilai Null']= [df.isnull().sum().sum() for df in data]

#Melakukan penjumlahan kolom yang terdapat nilai kosong ( Null )
info_df['Total Kolom Yang Berisi Null']= [len([col for col, null in df.isnull().sum().items() if null > 0]) for df in data]

#Melakukan pencarian nama kolom yang kosong
info_df['Nama Kolom Yang Berisi Null'] = [', '.join([col for col, null in df.isnull().sum().items() if null > 0]) for df in data]

info_df.style.background_gradient(cmap='Oranges')

In [20]:
#Menampilkan maximum data setiap kolom
max_data = df_passengers.max()
print(max_data)

_id               60d04ebfdb8077b4ebc989d9
PassengerId                             99
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                                  93.5
dtype: object

C:\Users\MSI GF63\AppData\Local\Temp\ipykernel_11328\1698379369.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  max_data = df_passengers.max()

In [22]:
#Menampilkan minimum data setiap kolom
min_data = df_passengers.min()
print(min_data)

_id            60d04ebfdb8077b4ebc9865f
PassengerId                           1
Survived                              0
Pclass                                1
Name                Abbing, Mr. Anthony
Sex                              female
SibSp                                 0
Parch                                 0
Ticket                           110152
Fare                                  0
dtype: object

C:\Users\MSI GF63\AppData\Local\Temp\ipykernel_11328\3949011608.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  min_data = df_passengers.min()

In [35]:
#Menampilkan umur maximum pada data
df_passengers.Age.max()

80

In [36]:
#menampilkan umur minimum pada data
df_passengers.Age.min()

0

In [40]:
df_passengers[df_passengers['Age'] > 18]

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S,C123
6,60d04ebfdb8077b4ebc98665,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,S,E46
11,60d04ebfdb8077b4ebc9866a,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.5500,S,C103
21,60d04ebfdb8077b4ebc98674,22,1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13.0000,S,D56
...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,60d04ebfdb8077b4ebc989c6,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47,1,1,11751,52.5542,S,D35
872,60d04ebfdb8077b4ebc989c7,873,0,1,"Carlsson, Mr. Frans Olof",male,33,0,0,695,5.0000,S,B51 B53 B55
879,60d04ebfdb8077b4ebc989ce,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56,0,1,11767,83.1583,C,C50
887,60d04ebfdb8077b4ebc989d6,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S,B42
889,60d04ebfdb8077b4ebc989d8,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C,C148

KESIMPULAN

Dalam python memiliki beberapa function dan method yang mempermudah kita sebagai programer dalam menerjemahkan suatu program yang ingin akan kita tampilkan penggunaan function dapat kita gunakan sebagai bentuk dasar penggunaan seperti menampilkan info menampilkan atribut menambilkan datamaximum minimum